#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//有些表达式的操作数在求值过程中可能需要转换为其它类型

//一、隐式类型转换
//C语言中，整形算数运算总是至少以缺省整形类型（int）的精度进行运算

//整型提升（长度小于int的）

//整数的2进制表示也有三种表示形式:
// 1.正的整数，原码、反码、补码相同
// 2.负的整数，原码、反码、补码是需要计算的
// 原码 : 直接通过正负的形式写出的二进制序列就是原码
// 反码 : 原码的符号位不变，其他位按位取反得到的就是反码
// 补码 : 反码 + 1就是补码

//源码取反加一得到补码，补码取反加一也能得到源码

//int main()
//{
//	//最高位是什么，剩下的就补什么
//	char a = -1;//负数整型提升
//	//10000000000000000000000000000001 -> -1的源码
//	//11111111111111111111111111111110 -> -1的反码（符号位不变，其他位按位取反）
//	//11111111111111111111111111111111 -> -1的补码（补码加1）
//	//11111111 -> a(a在内存中的内容，-1补码的后8个比特位）
//	//11111111111111111111111111111111 -> a整型提升后,得到的补码
//	//最高位为符号位，其他位补1
//	char b = 1;//正数整型提升
//	//00000000000000000000000000000001 -> 1的源码，反码，补码
//	//00000001 -> b
//	//00000000000000000000000000000001 -> b整型提升后
//	//最高位为符号位，其他位补0
//	unsigned char c = -1;
//	//无符号整型高位补0
//	return 0;
//}

//int main()
//{
//	char a = 5;
//	//00000000000000000000000000000101
//	//00000101  -> a
//	//00000000000000000000000000000101
//	char b = 126;
//	//00000000000000000000000001111110
//	//01111110  -> b
//	//00000000000000000000000001111110
//	char c = a + b;
//	//00000000000000000000000010000011
//	//10000011  -> c
//	printf("%d", c);
//	//11111111111111111111111110000011 补码
//	//11111111111111111111111110000010 反码
//	//10000000000000000000000001111101 源码 -125
//	return 0;
//}

//int main()
//{
//	 unsigned char a = 0xb6; 
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//	return 0;
//}
//
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));
//	printf("%u\n", sizeof(+c));
//	printf("%u\n", sizeof(-c));
//	return 0;
//}

//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//	return 0;
//}

#include <string.h>
//int main()
//{
//	char a[1000] = { 0 };
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));
//	return 0;
//}

int main()
{
	int a = -9;
	float* pFloat = (float*)&a;
	printf("%d\n", a);
	printf("%f\n", *pFloat);
	return 0;
}